; ModuleID = 'func_partition.bc'
source_filename = "func_partition.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.passwd = type { i8*, i8*, i8* }

@.str = private unnamed_addr constant [7 x i8] c"passwd\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.2 = private unnamed_addr constant [24 x i8] c"Unable to open passwd!\0A\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"Out of memory!\0A\00", align 1
@.str.4 = private unnamed_addr constant [23 x i8] c"Error reading passwd!\0A\00", align 1
@.str.5 = private unnamed_addr constant [3 x i8] c" \09\00", align 1
@.str.6 = private unnamed_addr constant [10 x i8] c"sensitive\00", section "llvm.metadata"
@.str.7 = private unnamed_addr constant [17 x i8] c"func_partition.c\00", section "llvm.metadata"
@.str.8 = private unnamed_addr constant [30 x i8] c"Usage: %s uid home_dir shell\0A\00", align 1
@.str.9 = private unnamed_addr constant [8 x i8] c"Error!\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define %struct.passwd* @pw_locate(i8* %id) #0 !dbg !16 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.0 (tags/RELEASE_400/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "func_partition.c", directory: "/home/james/code/test/prog_partition")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !1, line: 5, size: 192, elements: !7)
!7 = !{!8, !11, !12}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "pw_id", scope: !6, file: !1, line: 6, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !6, file: !1, line: 7, baseType: !9, size: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !6, file: !1, line: 8, baseType: !9, size: 64, offset: 128)
!13 = !{i32 2, !"Dwarf Version", i32 4}
!14 = !{i32 2, !"Debug Info Version", i32 3}
!15 = !{!"clang version 4.0.0 (tags/RELEASE_400/final)"}
!16 = distinct !DISubprogram(name: "pw_locate", scope: !1, file: !1, line: 11, type: !17, isLocal: false, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!17 = !DISubroutineType(types: !18)
!18 = !{!5, !19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!21 = !DILocalVariable(name: "id", arg: 1, scope: !16, file: !1, line: 11, type: !19)
!22 = !DIExpression()
!23 = !DILocation(line: 11, column: 38, scope: !16)
!24 = !DILocalVariable(name: "fp", scope: !16, file: !1, line: 12, type: !25)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !27, line: 48, baseType: !28)
!27 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/james/code/test/prog_partition")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !29, line: 241, size: 1728, elements: !30)
!29 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/james/code/test/prog_partition")
!30 = !{!31, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !52, !53, !54, !55, !59, !61, !63, !67, !70, !72, !73, !74, !75, !76, !80, !81}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !28, file: !29, line: 242, baseType: !32, size: 32)
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !28, file: !29, line: 247, baseType: !9, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !28, file: !29, line: 248, baseType: !9, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !28, file: !29, line: 249, baseType: !9, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !28, file: !29, line: 250, baseType: !9, size: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !28, file: !29, line: 251, baseType: !9, size: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !28, file: !29, line: 252, baseType: !9, size: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !28, file: !29, line: 253, baseType: !9, size: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !28, file: !29, line: 254, baseType: !9, size: 64, offset: 512)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !28, file: !29, line: 256, baseType: !9, size: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !28, file: !29, line: 257, baseType: !9, size: 64, offset: 640)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !28, file: !29, line: 258, baseType: !9, size: 64, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !28, file: !29, line: 260, baseType: !45, size: 64, offset: 768)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !29, line: 156, size: 192, elements: !47)
!47 = !{!48, !49, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !46, file: !29, line: 157, baseType: !45, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !46, file: !29, line: 158, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !46, file: !29, line: 162, baseType: !32, size: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !28, file: !29, line: 262, baseType: !50, size: 64, offset: 832)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !28, file: !29, line: 264, baseType: !32, size: 32, offset: 896)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !28, file: !29, line: 268, baseType: !32, size: 32, offset: 928)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !28, file: !29, line: 270, baseType: !56, size: 64, offset: 960)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !57, line: 131, baseType: !58)
!57 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/james/code/test/prog_partition")
!58 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !28, file: !29, line: 274, baseType: !60, size: 16, offset: 1024)
!60 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !28, file: !29, line: 275, baseType: !62, size: 8, offset: 1040)
!62 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !28, file: !29, line: 276, baseType: !64, size: 8, offset: 1048)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 1)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !28, file: !29, line: 280, baseType: !68, size: 64, offset: 1088)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !29, line: 150, baseType: null)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !28, file: !29, line: 289, baseType: !71, size: 64, offset: 1152)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !57, line: 132, baseType: !58)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !28, file: !29, line: 297, baseType: !4, size: 64, offset: 1216)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !28, file: !29, line: 298, baseType: !4, size: 64, offset: 1280)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !28, file: !29, line: 299, baseType: !4, size: 64, offset: 1344)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !28, file: !29, line: 300, baseType: !4, size: 64, offset: 1408)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !28, file: !29, line: 302, baseType: !77, size: 64, offset: 1472)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !78, line: 62, baseType: !79)
!78 = !DIFile(filename: "/home/james/code/llvm-4.0.0.src/build/bin/../lib/clang/4.0.0/include/stddef.h", directory: "/home/james/code/test/prog_partition")
!79 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !28, file: !29, line: 303, baseType: !32, size: 32, offset: 1536)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !28, file: !29, line: 305, baseType: !82, size: 160, offset: 1568)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 20)
!85 = !DILocation(line: 12, column: 8, scope: !16)
!86 = !DILocation(line: 12, column: 13, scope: !16)
!87 = !DILocation(line: 13, column: 6, scope: !88)
!88 = distinct !DILexicalBlock(scope: !16, file: !1, line: 13, column: 6)
!89 = !DILocation(line: 13, column: 9, scope: !88)
!90 = !DILocation(line: 13, column: 6, scope: !16)
!91 = !DILocation(line: 14, column: 11, scope: !92)
!92 = distinct !DILexicalBlock(scope: !88, file: !1, line: 13, column: 18)
!93 = !DILocation(line: 14, column: 3, scope: !92)
!94 = !DILocation(line: 15, column: 3, scope: !92)
!95 = !DILocalVariable(name: "buf", scope: !16, file: !1, line: 17, type: !96)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 256)
!99 = !DILocation(line: 17, column: 7, scope: !16)
!100 = !DILocalVariable(name: "pw", scope: !16, file: !1, line: 18, type: !5)
!101 = !DILocation(line: 18, column: 17, scope: !16)
!102 = !DILocation(line: 18, column: 39, scope: !16)
!103 = !DILocation(line: 18, column: 22, scope: !16)
!104 = !DILocation(line: 19, column: 6, scope: !105)
!105 = distinct !DILexicalBlock(scope: !16, file: !1, line: 19, column: 6)
!106 = !DILocation(line: 19, column: 9, scope: !105)
!107 = !DILocation(line: 19, column: 6, scope: !16)
!108 = !DILocation(line: 20, column: 11, scope: !109)
!109 = distinct !DILexicalBlock(scope: !105, file: !1, line: 19, column: 18)
!110 = !DILocation(line: 20, column: 3, scope: !109)
!111 = !DILocation(line: 21, column: 3, scope: !109)
!112 = !DILocation(line: 23, column: 2, scope: !16)
!113 = !DILocation(line: 23, column: 15, scope: !114)
!114 = !DILexicalBlockFile(scope: !16, file: !1, discriminator: 1)
!115 = !DILocation(line: 23, column: 10, scope: !114)
!116 = !DILocation(line: 23, column: 9, scope: !114)
!117 = !DILocation(line: 23, column: 2, scope: !114)
!118 = !DILocation(line: 24, column: 13, scope: !119)
!119 = distinct !DILexicalBlock(scope: !120, file: !1, line: 24, column: 7)
!120 = distinct !DILexicalBlock(scope: !16, file: !1, line: 23, column: 20)
!121 = !DILocation(line: 24, column: 31, scope: !119)
!122 = !DILocation(line: 24, column: 7, scope: !119)
!123 = !DILocation(line: 24, column: 35, scope: !119)
!124 = !DILocation(line: 24, column: 7, scope: !120)
!125 = !DILocation(line: 25, column: 12, scope: !126)
!126 = distinct !DILexicalBlock(scope: !119, file: !1, line: 24, column: 44)
!127 = !DILocation(line: 25, column: 4, scope: !126)
!128 = !DILocation(line: 26, column: 4, scope: !126)
!129 = !DILocalVariable(name: "p", scope: !120, file: !1, line: 28, type: !9)
!130 = !DILocation(line: 28, column: 9, scope: !120)
!131 = !DILocation(line: 28, column: 20, scope: !120)
!132 = !DILocation(line: 28, column: 13, scope: !120)
!133 = !DILocation(line: 29, column: 7, scope: !134)
!134 = distinct !DILexicalBlock(scope: !120, file: !1, line: 29, column: 7)
!135 = !DILocation(line: 29, column: 7, scope: !120)
!136 = !DILocation(line: 30, column: 23, scope: !134)
!137 = !DILocation(line: 30, column: 16, scope: !134)
!138 = !DILocation(line: 30, column: 4, scope: !134)
!139 = !DILocation(line: 30, column: 8, scope: !134)
!140 = !DILocation(line: 30, column: 14, scope: !134)
!141 = !DILocation(line: 32, column: 4, scope: !134)
!142 = distinct !{!142, !112, !143}
!143 = !DILocation(line: 46, column: 2, scope: !16)
!144 = !DILocation(line: 33, column: 14, scope: !145)
!145 = distinct !DILexicalBlock(scope: !120, file: !1, line: 33, column: 7)
!146 = !DILocation(line: 33, column: 18, scope: !145)
!147 = !DILocation(line: 33, column: 25, scope: !145)
!148 = !DILocation(line: 33, column: 7, scope: !145)
!149 = !DILocation(line: 33, column: 29, scope: !145)
!150 = !DILocation(line: 33, column: 7, scope: !120)
